---
title: Создание настраиваемых правил аналитики для обнаружения угроз с помощью Azure Sentinel | Документация Майкрософт
description: С помощью этого учебника вы узнаете, как создавать пользовательские правила аналитики для обнаружения угроз безопасности с помощью Sentinel в Azure. Воспользуйтесь преимуществами группирования событий, группирования оповещений и обогащения предупреждений, а затем изучите автоматическое отключение.
services: sentinel
documentationcenter: na
author: yelevin
manager: rkarlin
editor: ''
ms.service: azure-sentinel
ms.subservice: azure-sentinel
ms.devlang: na
ms.topic: conceptual
ms.tgt_pltfrm: na
ms.workload: na
ms.date: 02/10/2021
ms.author: yelevin
ms.openlocfilehash: 6f0a94daef8c5db820a17fe8cb50eda616bcf260
ms.sourcegitcommit: 910a1a38711966cb171050db245fc3b22abc8c5f
ms.translationtype: MT
ms.contentlocale: ru-RU
ms.lasthandoff: 03/20/2021
ms.locfileid: "102453984"
---
# <a name="tutorial-create-custom-analytics-rules-to-detect-threats"></a>Учебник. Создание настраиваемых правил аналитики для обнаружения угроз

Теперь, когда вы [подключились к источникам данных](quickstart-onboard.md) в Azure Sentinel, вы можете создать настраиваемые правила аналитики, которые помогут обнаружить угрозы и аномальные поведения, которые имеются в вашей среде. Эти правила выполняют поиск конкретных событий или наборов событий в среде, предупреждая вас о достижении определенных порогов или условий событий, создают инциденты для анализа и исследования, а также реагирования на угрозы с помощью автоматизированных процессов отслеживания и исправления. 

Этот учебник поможет вам создать настраиваемые правила для обнаружения угроз с помощью Azure Sentinel.

После завершения работы с этим руководством вы сможете сделать следующее:
> [!div class="checklist"]
> * Создание правил аналитики
> * Определение порядка обработки событий и предупреждений
> * Определение того, как создаются оповещения и инциденты
> * Выберите автоматические ответы на угрозы для правил

## <a name="create-a-custom-analytics-rule-with-a-scheduled-query"></a>Создание настраиваемого правила аналитики с помощью запланированного запроса

1. В меню навигации меток Azure выберите **аналитика**.

1. На панели действий вверху щелкните **+ создать** и выберите **запланированное правило запроса**. Откроется **Мастер правил аналитики**.

    :::image type="content" source="media/tutorial-detect-threats-custom/create-scheduled-query-small.png" alt-text="Создание запланированного запроса" lightbox="media/tutorial-detect-threats-custom/create-scheduled-query-full.png":::

### <a name="analytics-rule-wizard---general-tab"></a>Мастер правил аналитики — вкладка «Общие»

- Укажите уникальное **имя** и **Описание**. 

- В поле **тактика** можно выбрать один из категорий атак, по которым будет классифицироваться правило. Они основаны на тактике [Mitre атри&CK](https://attack.mitre.org/) Framework.

- Задайте соответствующее **серьезность** предупреждения. 

- При создании правила его **состояние** **включается** по умолчанию. Это означает, что оно будет запущено сразу после создания. Если вы не хотите, чтобы он выполнялся немедленно, выберите **отключено**, и правило будет добавлено на вкладку **активные правила** , и вы сможете включить его там, где это необходимо.

   :::image type="content" source="media/tutorial-detect-threats-custom/general-tab.png" alt-text="Начать создание настраиваемого правила аналитики":::

## <a name="define-the-rule-query-logic-and-configure-settings"></a>Определение логики запроса правила и Настройка параметров

На вкладке **задать логику правила** можно либо написать запрос непосредственно в поле **запроса правила** , либо создать запрос в log Analytics а затем скопировать и вставить его здесь.

- Запросы пишутся на языке запросов Kusto (KQL). Дополнительные сведения об [основных понятиях](/azure/data-explorer/kusto/concepts/) и [запросах](/azure/data-explorer/kusto/query/)ККЛ см. в этом удобном [кратком справочнике](/azure/data-explorer/kql-quick-reference).

- Пример, показанный на этом снимке экрана, запрашивает таблицу *SecurityEvent* для отображения типа [неудачных событий входа в Windows](/windows/security/threat-protection/auditing/event-4625).

   :::image type="content" source="media/tutorial-detect-threats-custom/set-rule-logic-tab-1-new.png" alt-text="Настройка логики и параметров правил запросов" lightbox="media/tutorial-detect-threats-custom/set-rule-logic-tab-all-1-new.png":::

- Вот еще один пример запроса, который оповещает вас о создании аномального количества ресурсов в [действии Azure](../azure-monitor/platform/activity-log.md).

    ```kusto
    AzureActivity
    | where OperationName == "Create or Update Virtual Machine" or OperationName =="Create Deployment"
    | where ActivityStatus == "Succeeded"
    | make-series dcount(ResourceId)  default=0 on EventSubmissionTimestamp in range(ago(7d), now(), 1d) by Caller
    ```

    > [!NOTE]
    > #### <a name="rule-query-best-practices"></a>Рекомендации по запросам правил
    > - Длина запроса должна составлять от 1 до 10 000 символов и не может содержать символы " `search *` " или " `union *` ".
    >
    > - Использование функций ADX для создания запросов Azure обозреватель данных в окне Log Analytics запроса **не поддерживается**.
    >
    > - При использовании **`bag_unpack`** функции в запросе, если столбцы запрашиваются в виде полей, использующих " `project field1` ", а столбец не существует, запрос завершится ошибкой. Чтобы защититься от этого, необходимо проецировать столбец следующим образом:
    >   - `project field1 = column_ifexists("field1","")`

### <a name="alert-enrichment"></a>Обогащение предупреждений

> [!IMPORTANT]
> Функции обогащения предупреждений в настоящее время доступны в **предварительной версии**. Ознакомьтесь с дополнительными [условиями использования Microsoft Azure](https://azure.microsoft.com/support/legal/preview-supplemental-terms/) предварительных версий для дополнительных юридических условий, которые относятся к функциям Azure, которые доступны в бета-версии, предварительном просмотре или еще не выпущены в общедоступную версию.
    
- Используйте раздел конфигурации **сопоставления сущностей** , чтобы сопоставить параметры из результатов запроса с сущностями, распознаваемыми в Azure Sentinel. Сущности расширяют выходные данные правил (предупреждения и инциденты) с помощью основной информации, которая служит в качестве стандартных блоков для любых исследовательских процессов и действий, которые следуют за ними. Они также представляют собой критерии, по которым можно группировать предупреждения в инциденты на вкладке **Параметры инцидента** .

    Дополнительные сведения о [сущностях в Azure Sentinel](entities-in-azure-sentinel.md).

    Инструкции по полному сопоставлению сущностей, а также важные сведения о [обратной совместимости](map-data-fields-to-entities.md#notes-on-the-new-version)см. [в статье сопоставление полей данных с сущностями в Azure Sentinel](map-data-fields-to-entities.md) .

- Раздел Конфигурация **пользовательских сведений** используется для извлечения элементов данных событий из запроса и их отображения в оповещениях, созданных этим правилом, что позволяет немедленно видеть сведения о событиях в предупреждениях и инцидентах.

    Дополнительные сведения см. в разделе отображая Custom Details in Alerts и ознакомьтесь с [полными инструкциями](surface-custom-details-in-alerts.md).

### <a name="query-scheduling-and-alert-threshold"></a>Расписание запросов и порог оповещений

- В разделе **планирование запросов** задайте следующие параметры.

   :::image type="content" source="media/tutorial-detect-threats-custom/set-rule-logic-tab-2.png" alt-text="Установка расписания запроса и группирования событий" lightbox="media/tutorial-detect-threats-custom/set-rule-logic-tab-all-2-new.png":::

    - Установите параметр **выполнять запрос каждые** , чтобы управлять частотой запуска запроса, как часто каждые 5 минут или как нечастое выполнение каждые 14 дней.

    - Установите **данные подстановки, начиная с последней** , чтобы определить период времени для данных, покрываемых запросом. Например, он может запросить данные за последние 10 минут или за последние 6 часов данных. Максимальное значение — 14 дней.

        > [!NOTE]
        > **Интервалы запросов и период лукбакк**
        >
        >  Эти два параметра не зависят друг от друга, вплоть до точки. Можно выполнить запрос через короткий интервал, охватывающий период времени, превышающий интервал (при наличии перекрывающихся запросов), но нельзя выполнить запрос с интервалом, превышающим период покрытия, иначе в общем объеме запроса будут пропуски.
        >
        > **Задержка приема**
        >
        > Для учета **задержки** , которая может возникнуть между созданием события в источнике и его приемом в Azure Sentinel, а также для обеспечения полного покрытия без дублирования данных, Azure Sentinel запускает запланированные правила аналитики в течение пяти минут с запланированной **задержкой** .
        >
        > Подробное техническое описание того, почему требуется эта задержка и как она решает эту проблему, см. в Рон Марсиано, отличная запись в блоге о том, что "[Обработка задержки приема в запланированных правилах оповещений в Azure Sentinel](https://techcommunity.microsoft.com/t5/azure-sentinel/handling-ingestion-delay-in-azure-sentinel-scheduled-alert-rules/ba-p/2052851)".

- Используйте раздел **порог оповещения** для определения уровня конфиденциальности правила. Например, установите параметр **создавать оповещение, если число результатов запроса** **превышает** и введите число 1000, если необходимо, чтобы правило создавало предупреждение только в том случае, если запрос возвращает больше 1000 результатов при каждом запуске. Это обязательное поле, поэтому если вы не хотите задавать порог, то есть если вы хотите, чтобы оповещение регистрировало каждое событие, введите 0 в поле номер.
    
### <a name="results-simulation"></a>Имитация результатов

В области **имитация результатов** в правой части мастера выберите **тест с текущими данными** , а Azure Sentinel покажет диаграмму результатов (события журнала), которые будут созданы запросом за последние 50 раз, когда он был выполнен в соответствии с заданным графиком. При изменении запроса снова выберите **проверить с текущими данными** , чтобы обновить граф. На диаграмме показано количество результатов за определенный период времени, которое определяется параметрами в разделе " **планирование запросов** ".
  
Вот как может выглядеть результат моделирования результатов для запроса на снимке экрана выше. Левая часть является представлением по умолчанию, а правая часть — это то, что отображается при наведении указателя мыши на момент времени на диаграмме.

:::image type="content" source="media/tutorial-detect-threats-custom/results-simulation.png" alt-text="Снимки экрана моделирования результатов":::

Если вы видите, что запрос запускает слишком много или слишком частое оповещение, можно поэкспериментировать с параметрами в [разделах](#query-scheduling-and-alert-threshold) **планирование запросов** и **порог оповещений** и выбрать повторное **тестирование с текущими данными** .

### <a name="event-grouping-and-rule-suppression"></a>Группирование событий и подавление правил

> [!IMPORTANT]
> Сейчас Группирование событий находится на **этапе предварительной версии**. Ознакомьтесь с дополнительными [условиями использования Microsoft Azure](https://azure.microsoft.com/support/legal/preview-supplemental-terms/) предварительных версий для дополнительных юридических условий, которые относятся к функциям Azure, которые доступны в бета-версии, предварительном просмотре или еще не выпущены в общедоступную версию.
    
- В разделе **Группирование событий** выберите один из двух способов для управления группированием **событий** в **оповещения**. 

    - **Сгруппируйте все события в одно предупреждение** (значение по умолчанию). Правило создает одно предупреждение при каждом запуске, пока запрос возвращает больше результатов, чем указано выше **порогового значения предупреждения** . Предупреждение содержит сводку по всем событиям, возвращенным в результатах. 

    - **Выдавать оповещение для каждого события.** Правило создает уникальное оповещение для каждого события, возвращенного запросом. Это полезно, если требуется, чтобы события отображались по отдельности, или если вы хотите сгруппировать их по определенным параметрам — по пользователю, имени узла или что-либо другому. Эти параметры можно определить в запросе.
    
        Сейчас количество оповещений, которое может создать правило, ограничено до 20. Если в определенном правиле указано, что **Группирование событий** **запускает оповещение для каждого события**, а запрос правила возвращает более 20 событий, каждое из первых 19 событий создаст уникальное оповещение, а в 20-й — все возвращаемые события. Иными словами, 20-й оповещение — это то, что было бы создано при выборе параметра **Группировать все события в одно оповещение** .

    > [!NOTE]
    > В чем разница между **событиями** и **предупреждениями**?
    >
    > - **Событие** представляет собой описание одного вхождения действия. Например, одна запись в файле журнала может считаться событием. В этом контексте событие ссылается на один результат, возвращенный запросом в правиле аналитики.
    >
    > - **Предупреждение** — это набор событий, которые, в совокупности, являются значительными для точки зрения безопасности. Предупреждение может содержать одно событие, если событие приводило к существенным последствиям для безопасности — например, административное имя входа из внешней страны за пределами Office Hours.
    >
    > - Кстати, что такое **инциденты**? Внутренняя логика Azure Sentinel создает **инциденты** на основе **предупреждений** или групп предупреждений. Очередь инцидентов — это Фокальная точка рассмотрения аналитиков SOC, исследования и исправления.
    > 
    > Sentinel Azure принимает необработанные события из некоторых источников данных и уже обрабатывали предупреждения от других. Важно отметить, с какой из них вы работаете в любое время.

- В разделе **подавления** можно включить параметр **остановить выполнение запроса после создания предупреждения** **в** случае, если при получении предупреждения вы хотите приостановить операцию этого правила в течение определенного периода времени, превышающего интервал запроса. Если включить этот параметр, необходимо задать для параметра **прерывать выполнение запросов** значение в течение времени, в течение которого запрос должен прерываться до 24 часов.

## <a name="configure-the-incident-creation-settings"></a>Настройка параметров создания инцидентов

На вкладке **Параметры инцидента** можно выбрать, будет ли и как Azure Sentinel переключать предупреждения в инциденты, требующие действий. Если эта вкладка не оставлена, Azure Sentinel создаст один отдельный инцидент из каждого предупреждения. Можно выбрать отсутствие инцидентов или сгруппировать несколько предупреждений в один инцидент, изменив параметры на этой вкладке.

> [!IMPORTANT]
> Вкладка Параметры инцидента сейчас доступна в **предварительной версии**. Ознакомьтесь с дополнительными [условиями использования Microsoft Azure](https://azure.microsoft.com/support/legal/preview-supplemental-terms/) предварительных версий для дополнительных юридических условий, которые относятся к функциям Azure, которые доступны в бета-версии, предварительном просмотре или еще не выпущены в общедоступную версию.

:::image type="content" source="media/tutorial-detect-threats-custom/incident-settings-tab.png" alt-text="Определение параметров создания инцидентов и группирования оповещений":::

### <a name="incident-settings"></a>Параметры инцидента

В разделе **Параметры инцидента** **Создание инцидентов на основе предупреждений, активированных этим правилом аналитики** по умолчанию устанавливается в значение **включено**. Это означает, что метка Azure создает один отдельный инцидент от каждого предупреждения, инициированного правилом.
    
- Если вы не хотите, чтобы это правило приводило к созданию инцидентов (например, если это правило только собирает сведения для последующего анализа), установите для этого параметра значение **отключено**.

- Если необходимо создать один инцидент из группы оповещений, а не по одному, см. следующий раздел.

### <a name="alert-grouping"></a>Группирование оповещений

Если вы хотите, чтобы один инцидент создавался из группы до 150 схожих или повторяющихся оповещений (см. Примечание) в разделе **группирование оповещений** , **Задайте для** параметра **связанные с группой предупреждения, активируемые этим правилом аналитики,** а затем задайте следующие параметры.

- **Ограничьте группу предупреждениями, созданными в течение выбранного периода времени**: Определите интервал времени, в течение которого будут группироваться похожие или повторяющиеся оповещения. Все соответствующие предупреждения в течение этого промежутка времени будут собираются инцидентом или набором инцидентов (в зависимости от приведенных ниже параметров группирования). Оповещения за пределами этого промежутка времени будут создавать отдельные инциденты или наборы инцидентов.

- **Группировать предупреждения, активируемые этим правилом аналитики, в один инцидент**: выберите базу, в которой будут сгруппированы оповещения:

    - **Группировать предупреждения в один инцидент, если все сущности совпадают**: оповещения группируются вместе, если они совместно используют одинаковые значения для каждой из сопоставленных сущностей (определенных на вкладке логика набора правил выше). Это рекомендуемый параметр.

    - **Сгруппируйте все предупреждения, активируемые этим правилом, в один инцидент**: все предупреждения, создаваемые этим правилом, группируются вместе, даже если они не имеют одинаковых значений.

    - **Группировать предупреждения в один инцидент, если выбранные сущности совпадают**: оповещения группируются, если они имеют одинаковые значения для некоторых сопоставленных сущностей (которые можно выбрать из раскрывающегося списка). Этот параметр может потребоваться использовать, например, если необходимо создать отдельные инциденты на основе исходного или целевого IP-адреса.

- **Повторно открыть закрытые совпадающие инциденты**. Если инцидент был разрешен и закрыт, а позднее в другом оповещении будет состоять из этого инцидента, установите этот параметр в значение **Enabled (включено** ), если хотите повторно открыть закрытое инцидент, и оставьте его **отключенным** , если вы хотите, чтобы оповещение создавало новый инцидент.
    
    > [!NOTE]
    > **До 150 оповещений** можно сгруппировать в один инцидент. Если в правиле, которое группирует их в один инцидент, создано более 150 предупреждений, будет сформирован новый инцидент с теми же сведениями об инциденте, что и у исходного, а избыточные предупреждения будут сгруппированы в новый инцидент.

## <a name="set-automated-responses-and-create-the-rule"></a>Установка автоматических ответов и создание правила

1. На вкладке **автоматизированные ответы** выберите любой модули PlayBook, который требуется запустить автоматически при создании оповещения настраиваемым правилом. Дополнительные сведения о создании и автоматизации модули PlayBook см. в разделе [реагирование на угрозы](tutorial-respond-threats-playbook.md).

    :::image type="content" source="media/tutorial-detect-threats-custom/automated-response-tab.png" alt-text="Определение параметров автоматического ответа":::

1. Выберите **проверить и создать** , чтобы проверить все параметры нового правила генерации оповещений. Когда появится сообщение "Проверка пройдена", выберите **создать** , чтобы инициализировать правило оповещения.

    :::image type="content" source="media/tutorial-detect-threats-custom/review-and-create-tab.png" alt-text="Проверьте все параметры и создайте правило.":::

## <a name="view-the-rule-and-its-output"></a>Просмотр правила и его выходных данных
  
- Созданное настраиваемое правило (типа "запланировано") можно найти в таблице на вкладке " **активные правила** " на экране главного средства **аналитики** . В этом списке можно включить, отключить или удалить каждое правило.

- Чтобы просмотреть результаты создаваемых правил генерации оповещений, перейдите на страницу **инциденты** , где можно рассмотреть, [исследовать инциденты](tutorial-investigate-cases.md)и устранить угрозы.

> [!NOTE]
> Оповещения, созданные в Azure Sentinel, доступны через [Microsoft Graph безопасность](/graph/security-concept-overview). Дополнительные сведения см. в [документации по Microsoft Graph оповещениями системы безопасности](/graph/api/resources/security-api-overview).

## <a name="troubleshooting"></a>Устранение неполадок

### <a name="issue-no-events-appear-in-query-results"></a>Ошибка: в результатах запроса не отображаются события

Если **Группирование событий** настроено на **срабатывание предупреждения для каждого события**, то в некоторых случаях при просмотре результатов запроса в более позднее время (например, при откате к предупреждениям из инцидента) может возникнуть отсутствие результатов запроса. Это происходит потому, что соединение события с предупреждением выполняется путем хэширования сведений о конкретном событии и включения хэша в запрос. Если результаты запроса изменились с момента создания предупреждения, хэш больше не будет действителен и результаты не будут отображаться. 

Чтобы просмотреть события, вручную удалите строку с хэшем из запроса правила и выполните запрос.

### <a name="issue-a-scheduled-rule-failed-to-execute-or-appears-with-auto-disabled-added-to-the-name"></a>Ошибка: не удалось выполнить запланированное правило или оно отображается с АВТОМАТИЧЕСКИм добавлением к имени

Это редкая ситуация, когда запланированное правило запроса не запускается, но может произойти. Azure Sentinel классифицирует сбои, как временные или постоянные, исходя из конкретного типа сбоя и обстоятельств, которые привели к нему.

#### <a name="transient-failure"></a>Временный сбой

Временный сбой происходит из-за ситуации, которая является временной и вскоре вернется в нормальный режим, после чего выполнение правила будет успешно завершено. Ниже приведены некоторые примеры сбоев, которые могут классифицироваться в Azure Sentinel как временные.

- Выполнение запроса правила занимает слишком много времени, и его время ожидания истекает.
- Проблемы с подключением между источниками данных и Log Analytics, а также между Log Analytics и Sentinel a Azure.
- Любой другой новый и Неизвестный сбой считается временным.

В случае временного сбоя Sentinel Azure повторяет попытку повторного выполнения правила после предварительно заданных и постоянно увеличивающихся интервалов до точки. После этого правило будет выполняться снова только в следующее запланированное время. Правило никогда не будет отключено в автоматическом состоянии из-за временной ошибки.

#### <a name="permanent-failure---rule-auto-disabled"></a>Постоянный Сбой — правило отключено для автоматического отключения

Постоянный сбой происходит из-за изменения условий, которые позволяют выполнить правило, что без вмешательства человека не вернется к их состоянию. Ниже приведены некоторые примеры сбоев, которые классифицируются как постоянные.

- Целевая рабочая область (на которой работает запрос правила) удалена.
- Целевая таблица (на которой работает запрос правила) удалена.
- Sentinel Azure был удален из целевой рабочей области.
- Функция, используемая запросом правила, больше не действительна; Он либо был изменен, либо удален.
- Изменены разрешения для одного из источников данных запроса правила.
- Один из источников данных запроса правила был удален или отключен.

**В случае предопределенного числа последовательных постоянных сбоев одного и того же типа и в том же правиле** Sentinel Azure не пытается выполнить правило, а также выполняет следующие действия:

- Отключает правило.
- Добавляет слова **«Auto Disabled»** в начало имени правила.
- Добавляет причину сбоя (и отключения) в описание правила.

Можно легко определить присутствие всех правил автоматического отключения, сортируя список правил по имени. Правила автоматического отключения будут находиться в верхней части списка или рядом с ним.

Менеджеры SOC должны регулярно проверять список правил на наличие правил автоматического отключения.

## <a name="next-steps"></a>Дальнейшие действия

В этом руководстве вы узнали, как приступить к обнаружению угроз с помощью Sentinel Azure.

- Узнайте, как [исследовать инциденты в Azure Sentinel](tutorial-investigate-cases.md).
- Сведения о [сущностях в Azure Sentinel](entities-in-azure-sentinel.md).
- Узнайте, как [настроить автоматические ответы на угрозы в Azure Sentinel](tutorial-respond-threats-playbook.md).
